{
  "backend/main.mo": "Access control setup and user profile management with role checks, plus type definitions for tools, images, and models.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to impacted frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of multiple frontend files in the project.",
  "frontend/index.html": "Base HTML document loading fonts and mounting the React app root with main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication state, routing between pages, and conditional profile setup modal display.",
  "frontend/src/components/CustomToolManagerDialog.tsx": "Dialog UI for creating, editing, and deleting custom tools with dynamic property management.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback interface and reload option when runtime errors occur.",
  "frontend/src/components/Footer.tsx": "Simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main header with navigation, theme toggle, user profile menu, and logout handling based on authentication state.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a landing/login screen with branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/model/ExampleSetupsField.tsx": "Manages a list of example setup images, allowing upload, description editing, and removal. Uses ExternalBlob for binary storage handling.",
  "frontend/src/components/model/ExternalBlobImage.tsx": "Displays an image stored in an ExternalBlob with loading and error states. Shows a spinner until the image loads successfully.",
  "frontend/src/components/model/ModelNotecard.tsx": "Renders a summary card for a model, showing grouped tool summaries across narrative, framework, and execution. Extracts and displays key tool properties for quick overview.",
  "frontend/src/components/ModelBuilder.tsx": "Provides a full interface for creating and editing trading models, including tool selection, configuration, custom tools, and example setups.",
  "frontend/src/components/ModelCardSummary.tsx": "Shows a summary dialog for a model with concise tool property previews and options to go back or save.",
  "frontend/src/components/ModelWizard.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name input and backend save handling.",
  "frontend/src/components/SetupIdentifier.tsx": "Identifies which model best matches selected tool observations, computing adherence scores and allowing model selection.",
  "frontend/src/components/ToolConfigDialog.tsx": "Large dialog component for configuring tool properties, including dynamic form fields based on tool type and zone. Provides save/close callbacks and contains extensive option enums.",
  "frontend/src/components/trade-calendar/TradeCalendarDayCell.tsx": "Calendar day cell showing trade aggregates like P/L, percent, and R-multiple. Supports click interaction when trades are present.",
  "frontend/src/components/trade-calendar/TradeCalendarMonth.tsx": "Displays a full month calendar with navigation and weekday headers. Renders day cells and forwards click events for day-level interactions.",
  "frontend/src/components/trade-calendar/TradeCalendarWeek.tsx": "Renders a weekly trade calendar view with weekday headers and day cells, plus a button to open the full calendar.",
  "frontend/src/components/trade-calendar/TradeDayDrilldownDialog.tsx": "Displays a dialog showing a day's trade aggregates and a list of trades with P/L and direction indicators.",
  "frontend/src/components/trade/BracketOutcomeSelector.tsx": "Provides buttons to select a bracket closure outcome type for a trade.",
  "frontend/src/components/trade/EmojiMultiSelect.tsx": "Renders emoji mood options allowing a single emoji to be selected.",
  "frontend/src/components/trade/ManualClosePriceField.tsx": "Numeric input field for entering a manual close price with basic validation.",
  "frontend/src/components/trade/TradeImagesField.tsx": "Manages uploading, previewing, and removing trade screenshot images using ExternalBlob objects.",
  "frontend/src/components/trade/TradeOutcomeEditor.tsx": "Full editor for completing trade outcomes, including bracket states, notes, mood, images, and close time handling.",
  "frontend/src/components/TradeDetailDialog.tsx": "Dialog for viewing and editing a trade's outcome using TradeOutcomeEditor. Handles save operations and displays success/error toasts.",
  "frontend/src/components/TradeForm.tsx": "Complex form for creating or editing trades, including model selection, position sizing, validations, and scenario calculations. Integrates multiple hooks, helpers, and UI components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout flow.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on models and trades via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, and layout utilities including safe-area and trade form rules.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers and mounts the root component.",
  "frontend/src/pages/Analytics.tsx": "Loads models and trades, applies filters, computes analytics metrics, and renders a multi-tab analytics dashboard.",
  "frontend/src/pages/Dashboard.tsx": "Displays high-level trading stats, equity curve, recent trades, top models, and a weekly trade calendar.",
  "frontend/src/pages/Models.tsx": "Models page that lists, creates, edits, deletes, and views trading models using ModelBuilder and ModelViewer.",
  "frontend/src/pages/ModelViewer.tsx": "Fetches a model and its trades, computes performance metrics, and shows model details with example images.",
  "frontend/src/pages/Trades.tsx": "Trades page that displays, filters, edits, deletes, and analyzes trades with outcome editing and model-based setup identification.",
  "frontend/src/utils/analytics/adherence.ts": "Functions to filter trades by adherence score and compute adherence-based performance metrics and comparisons.",
  "frontend/src/utils/analytics/brackets.ts": "Computes per-bracket performance metrics including hit rates and average R values for bracketed trades.",
  "frontend/src/utils/analytics/distributions.ts": "Bins numeric R values into histogram buckets for distribution analysis.",
  "frontend/src/utils/analytics/equityCurve.ts": "Computes cumulative equity curve and max drawdown from completed trades.",
  "frontend/src/utils/analytics/htfBias.ts": "Derives higher‑timeframe bias from model tools and computes trade performance grouped by bias.",
  "frontend/src/utils/analytics/metrics.ts": "Calculates overall performance stats such as win rate, PL, R metrics, and profit factor.",
  "frontend/src/utils/analytics/monteCarlo.ts": "Runs Monte Carlo simulations using empirical R values to model equity paths and summary stats.",
  "frontend/src/utils/analytics/sessionAnalytics.ts": "Determines trade sessions and computes performance metrics grouped by trading session.",
  "frontend/src/utils/analytics/timeBuckets.ts": "Computes hourly and weekday trade metrics including counts, win rates, and total P/L for completed trades.",
  "frontend/src/utils/analytics/toolImpact.ts": "Calculates impact metrics for each tool type by comparing trade performance using that tool against overall baselines.",
  "frontend/src/utils/analytics/tradeScope.ts": "Provides session inference and filters trades by model, session, and adherence, plus helpers for completed trades.",
  "frontend/src/utils/analytics/volatility.ts": "Buckets trades by a volatility proxy and computes metrics such as win rate, P/L, and R distribution per bucket.",
  "frontend/src/utils/setupIdentifier/adherence.ts": "Maps observed tools to model conditions and computes adherence scores based on checked conditions.",
  "frontend/src/utils/trade/outcomeMath.ts": "Derives bracket closure prices and computes total P/L, percentage P/L, and R:R for a trade from its outcomes.",
  "frontend/src/utils/trade/outcomeModel.ts": "Maps between editable bracket outcome state and persisted outcome structures.",
  "frontend/src/utils/trade/reflectionModel.ts": "Extracts and merges reflection fields such as notes, mood, images, and decisions on taking the trade again.",
  "frontend/src/utils/trade/tradeCalendar.ts": "Aggregates completed trades by date and builds a month calendar grid with daily P/L and R stats.",
  "frontend/src/utils/trade/tradeMetrics.ts": "Computes total P/L, R:R, and winner/loser status from a trade’s bracket outcomes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to get URL parameters, persist them in sessionStorage, and remove them from the hash for routing and state management.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, feature requests, known issues, and versioned state for the mobile model builder improvements."
}