{
  "backend/main.mo": "Actor manages access control, auto‑registers users, stores profiles, and exposes profile and role operations plus blob‑storage mixin setup.",
  "backend/migration.mo": "Defines old and new data structures and provides migration logic to transform existing state to include custom tool support.",
  "feature_evidence.json": "Lists implemented features, associated files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Contains human‑written summaries for key frontend files including hooks, pages, and components.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, page navigation, and profile setup modal display.",
  "frontend/src/components/CustomToolManagerDialog.tsx": "Dialog UI for listing, creating, editing, and deleting custom tool definitions with form validation and React Query mutations.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a fallback UI with reload option.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, user menu, and authenticated navigation links.",
  "frontend/src/components/LoginPrompt.tsx": "Login landing page prompting users to authenticate and showcasing app features.",
  "frontend/src/components/ModelBuilder.tsx": "Complex model creation editor supporting ICT tools, custom tools, and tool configuration dialogs.",
  "frontend/src/components/ModelCardSummary.tsx": "Dialog summarizing a model’s tools and details with concise property extraction and save/back actions.",
  "frontend/src/components/ModelWizard.tsx": "Empty placeholder file for a model creation wizard.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name input and backend save integration.",
  "frontend/src/components/ToolConfigDialog.tsx": "Large dialog component for configuring tool properties with many predefined enums and dynamic form fields based on tool type.",
  "frontend/src/components/TradeDetailDialog.tsx": "Dialog for viewing and updating trade details including bracket outcomes, emotions, notes, and uploaded images.",
  "frontend/src/components/TradeForm.tsx": "Form for creating or editing a trade, handling model selection, trade parameters, validations, and scenario calculations.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and related auth state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for profiles, models, trades, and custom tool definitions.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/pages/Analytics.tsx": "Displays trading and adherence analytics with charts, model filtering, and computed performance metrics.",
  "frontend/src/pages/Dashboard.tsx": "Shows an overview of models and trades, computing performance stats and an equity curve.",
  "frontend/src/pages/Models.tsx": "Lists, creates, edits, and deletes trading models with a model builder dialog.",
  "frontend/src/pages/Trades.tsx": "Manages viewing, filtering, sorting, editing, and deleting trades, including status detection and detail dialogs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color tokens, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines current project state, versioning, and a detailed feature inventory for the ICT Trading Logger dapp including authentication, RBAC, models, trades, and frontend/backend architecture."
}