{
  "backend/main.mo": "Main canister logic managing access control, user profiles, and model/trade-related types with automatic user registration and role checks.",
  "backend/migration.mo": "Defines OldTrade and NewTrade structures and provides migration logic for upgrading stored trade data, including new tag fields and blob-based images.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, and test IDs for enhanced trade notes and screenshot blob storage.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend components, pages, hooks, and styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app managing authentication state, page navigation, and conditional display of the profile setup modal.",
  "frontend/src/components/CustomToolManagerDialog.tsx": "Dialog component for creating, editing, reordering, and deleting custom trading tools with dynamic fields and option handling.",
  "frontend/src/components/ErrorBoundary.tsx": "Reusable React error boundary that catches render errors and displays a fallback UI with reload option.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with a copyright notice and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the main app header with navigation, theme toggle, and user auth controls.",
  "frontend/src/components/LoginPrompt.tsx": "Provides a landing and login screen with feature descriptions and an Internet Identity login button.",
  "frontend/src/components/ModelBuilder.tsx": "Implements a full model creation and editing interface with ICT tool configurations and custom tool management.",
  "frontend/src/components/ModelCardSummary.tsx": "Shows a summary dialog of a model’s tools with concise property extraction and save/back actions.",
  "frontend/src/components/ModelWizard.tsx": "Empty placeholder file for a future model creation wizard.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile by entering a name and saving it via backend mutation.",
  "frontend/src/components/SetupIdentifier.tsx": "Allows users to select observed tools, computes adherence against saved models, and returns qualifying model matches.",
  "frontend/src/components/ToolConfigDialog.tsx": "A large dialog component for editing tool configurations, providing dynamic property editors based on tool type and predefined option sets.",
  "frontend/src/components/trade/BracketOutcomeSelector.tsx": "UI control for selecting a bracket’s closure outcome via preset buttons.",
  "frontend/src/components/trade/EmojiMultiSelect.tsx": "Emoji-based mood selector allowing single-choice selection for trade journaling.",
  "frontend/src/components/trade/ManualClosePriceField.tsx": "Numeric input field for entering a manual close price with validation.",
  "frontend/src/components/trade/TradeImagesField.tsx": "Image upload and preview component allowing adding and removing trade screenshots.",
  "frontend/src/components/trade/TradeOutcomeEditor.tsx": "Editor for completing trade outcomes, managing bracket outcomes, notes, mood, images, and validation before saving.",
  "frontend/src/components/TradeDetailDialog.tsx": "Dialog wrapping TradeOutcomeEditor, handling save logic and displaying trade outcome details.",
  "frontend/src/components/TradeForm.tsx": "Comprehensive trade creation/edit form with model selection, position sizing, validation, and scenario calculations.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity loading states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating models, trades, and other backend data through an actor interface.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines custom CSS variables plus responsive layout rules for trade-related UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Analytics.tsx": "Renders an analytics dashboard that filters trades and computes various performance metrics, distributions, and visualizations.",
  "frontend/src/pages/Dashboard.tsx": "Displays a high-level trading dashboard with performance stats, equity curve, recent trades, and top model summaries.",
  "frontend/src/pages/Models.tsx": "Displays and manages trading models, including create, edit, and delete actions with a builder dialog.",
  "frontend/src/pages/Trades.tsx": "Lists, filters, sorts, and manages trades with support for creating, editing, viewing, outcomes, and model-based preloading.",
  "frontend/src/utils/analytics/adherence.ts": "Computes adherence-based filters and performance metrics, including comparisons between high- and low-adherence trades.",
  "frontend/src/utils/analytics/brackets.ts": "Calculates bracket-level performance metrics such as TP/SL hit rates and average R for each bracket index.",
  "frontend/src/utils/analytics/distributions.ts": "Generates histogram bins from R values using equal-width binning.",
  "frontend/src/utils/analytics/equityCurve.ts": "Builds cumulative equity curves from completed trades and computes maximum drawdown.",
  "frontend/src/utils/analytics/htfBias.ts": "Infers HTF bias from model tools and groups trades to compute bias-specific performance metrics.",
  "frontend/src/utils/analytics/metrics.ts": "Computes overall performance metrics including win rate, PL, R, profit factor, and averages.",
  "frontend/src/utils/analytics/monteCarlo.ts": "Runs Monte Carlo simulations using empirical R values to project equity paths and summarize results.",
  "frontend/src/utils/analytics/sessionAnalytics.ts": "Assigns trades to trading sessions and computes session-level win rate, PL, and R metrics.",
  "frontend/src/utils/analytics/timeBuckets.ts": "Computes hourly and weekday trade metrics including counts, win rate, and P/L for completed trades.",
  "frontend/src/utils/analytics/toolImpact.ts": "Calculates performance impact metrics for each tool type by comparing tool-specific results to overall trade baselines.",
  "frontend/src/utils/analytics/tradeScope.ts": "Infers trading session from timestamps and filters trades by model, session, and adherence score.",
  "frontend/src/utils/analytics/volatility.ts": "Buckets trades by volatility based on stop‑loss distance and computes win rate, P/L, and R metrics per bucket.",
  "frontend/src/utils/setupIdentifier/adherence.ts": "Maps observed tools to model conditions and computes adherence scores based on checked conditions.",
  "frontend/src/utils/trade/outcomeMath.ts": "Derives closure prices and calculates trade P/L, percentage return, and R:R from bracket outcomes.",
  "frontend/src/utils/trade/outcomeModel.ts": "Maps bracket outcome edit state to persisted format and back for manual or predefined closure types.",
  "frontend/src/utils/trade/reflectionModel.ts": "Extracts and merges reflection fields such as notes, mood, images, and review flags into trades.",
  "frontend/src/utils/trade/tradeMetrics.ts": "Computes total P/L, R:R ratio, and winner/loser status from completed trade outcomes.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "TailwindCSS config enabling dark mode, custom OKLCH color system, extended components, animations, and typography/container-query/animate plugins.",
  "project_state.json": "Project state file defining versioning, system summary, architectural notes, known issues, existing features, and pending analytics- and UI-related feature requests."
}