{
  "backend/main.mo": "Actor handling access control, automatic user registration, user profile storage, and blob-storage mixin setup.",
  "feature_evidence.json": "Feature evidence report describing a UI change for the custom tool manager and its associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files used for build reference.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level app component managing authentication, profile setup modal, and page navigation.",
  "frontend/src/components/CustomToolManagerDialog.tsx": "Dialog for creating, editing, and managing custom tools with draft-friendly comma‑separated option inputs.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback UI and allows page reload on errors.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and a caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Header with navigation, theme toggle, and authenticated user menu including logout.",
  "frontend/src/components/LoginPrompt.tsx": "Landing page prompting Internet Identity login and showcasing app features with cards.",
  "frontend/src/components/ModelBuilder.tsx": "Main UI for creating and editing ICT trading models with predefined and custom tools.",
  "frontend/src/components/ModelCardSummary.tsx": "Displays a concise review of model details and selected tools before saving.",
  "frontend/src/components/ModelWizard.tsx": "Empty placeholder component for a model creation wizard.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a new user's display name during initial profile setup.",
  "frontend/src/components/ToolConfigDialog.tsx": "Dialog for editing detailed configuration properties of an ICT tool, including unified property schemas.",
  "frontend/src/components/TradeDetailDialog.tsx": "Dialog for reviewing and updating trade outcomes, reflections, emotions, and image uploads.",
  "frontend/src/components/TradeForm.tsx": "Large trade creation and editing form handling model selection, pricing inputs, validation, scenario calculations, and UI rendering.",
  "frontend/src/hooks/useActor.ts": "Provides a react-query hook to create and manage an authenticated or anonymous backend actor and invalidate dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity loading, and an authentication provider component.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for loading and mutating models, trades, and user profiles through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode palettes, and global base styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, react-query, and Internet Identity provider.",
  "frontend/src/pages/Analytics.tsx": "Analytics dashboard computing trade metrics, adherence statistics, and visualizing them with charts and filters.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page fetching models and trades to compute trading stats, equity curve, recent trades, and top models, rendering charts and summary cards.",
  "frontend/src/pages/Models.tsx": "Models page listing all trading models with create, edit, and delete actions, including a builder modal and deletion confirmation.",
  "frontend/src/pages/Trades.tsx": "Trades page displaying, filtering, sorting, creating, viewing, editing, and deleting trades with model-aware status indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current feature set, schema version, and implemented frontend-backend functionality for the ICT trading logger."
}