{
  "backend/main.mo": "Actor implementing access control and user profile management with auto-registration and role checks, storing profiles in an OrderedMap.",
  "feature_evidence.json": "Feature evidence report listing UI changes for inline Trade Logger behavior and related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing functionality of various frontend files across the app.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, page routing, and conditional profile setup modal.",
  "frontend/src/components/CustomToolManagerDialog.tsx": "Dialog UI for creating, editing, ordering, and deleting custom tools with dynamic property management.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback UI and allows page reload on errors.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and a caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling theme toggle, user auth state, and navigation between pages.",
  "frontend/src/components/LoginPrompt.tsx": "Landing screen prompting users to authenticate via Internet Identity with feature highlights.",
  "frontend/src/components/ModelBuilder.tsx": "Interactive builder for creating and editing ICT trading models with tool selection and configuration.",
  "frontend/src/components/ModelCardSummary.tsx": "Dialog displaying a concise summary of a model’s tools and properties before saving.",
  "frontend/src/components/ModelWizard.tsx": "Empty placeholder file for a future multi‑step model creation wizard.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for capturing and saving a user's name during initial profile setup.",
  "frontend/src/components/SetupIdentifier.tsx": "Tool for comparing user-selected observations against saved models to compute adherence and suggest matching setups.",
  "frontend/src/components/ToolConfigDialog.tsx": "Renders a dialog for configuring tool settings with dynamic property fields based on tool type. Includes numerous predefined enums and a property configuration map used to generate the UI.",
  "frontend/src/components/TradeDetailDialog.tsx": "Displays a detailed editable view of a trade, including bracket outcomes, notes, emotions, and images. Handles loading trade data, updating bracket groups, and saving outcomes.",
  "frontend/src/components/TradeForm.tsx": "Provides a full form for creating or editing trades, including model selection, conditions, bracket setup, validation, and scenario calculations. Includes many helpers for numeric parsing and tool description extraction.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries when the identity changes. Provides the current actor and fetch status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook, managing authentication, stored identities, login flow, and related status flags. Wraps AuthClient and exposes login, clear, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for CRUD operations on models, trades, and related data via the backend actor. Automatically manages caching, invalidation, and dependent fetch behavior.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for themes, dark mode overrides, and responsive rules for a trade form layout to prevent overflow.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Analytics.tsx": "Loads trades and models, applies filters, computes extensive analytics metrics, and renders charts and insights.",
  "frontend/src/pages/Dashboard.tsx": "Displays high-level trading stats, equity curve, recent trades, and top model performance with navigation actions.",
  "frontend/src/pages/Models.tsx": "Lists trading models with create, edit, and delete capabilities using a model builder and confirmation dialogs.",
  "frontend/src/pages/Trades.tsx": "Manages viewing, filtering, creating, editing, and deleting trades with detailed dialogs and a trade form.",
  "frontend/src/utils/analytics/adherence.ts": "Computes adherence-based performance comparisons between all completed trades and those above an adherence threshold.",
  "frontend/src/utils/analytics/brackets.ts": "Calculates per-bracket metrics such as TP/SL hit rates and realized R across completed trades.",
  "frontend/src/utils/analytics/distributions.ts": "Creates histogram bins from R values by evenly splitting their range and counting items per bin.",
  "frontend/src/utils/analytics/equityCurve.ts": "Computes an equity curve and max drawdown from completed trades using cumulative P/L over time.",
  "frontend/src/utils/analytics/htfBias.ts": "Derives HTF bias from model tools and aggregates trade performance metrics grouped by bias type.",
  "frontend/src/utils/analytics/metrics.ts": "Calculates overall performance metrics such as win rate, P/L totals, averages, and profit factor for completed trades.",
  "frontend/src/utils/analytics/monteCarlo.ts": "Runs Monte Carlo simulations using trade R values to generate random equity paths and summary statistics.",
  "frontend/src/utils/analytics/sessionAnalytics.ts": "Computes trading metrics per session (Asia, London, NY) based on trade timestamps and completed trade data.",
  "frontend/src/utils/analytics/timeBuckets.ts": "Aggregates trades into hourly and weekday buckets, computing win rates and P/L for each group.",
  "frontend/src/utils/analytics/toolImpact.ts": "Evaluates each tool's performance impact by comparing metrics for trades with vs. without the tool.",
  "frontend/src/utils/analytics/tradeScope.ts": "Provides session inference and filters trades by model, session, and adherence, plus a helper for completed trades.",
  "frontend/src/utils/analytics/volatility.ts": "Groups trades into volatility buckets using stop‑loss/entry ratios and computes performance metrics for each.",
  "frontend/src/utils/setupIdentifier/adherence.ts": "Maps selected observations to model conditions and computes an adherence score based on checked conditions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params (including hash routing) and persisting them in sessionStorage, with helpers to clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color tokens, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state and requirements for converting the Trade Logger modal into an inline embedded UI on the Trades page."
}