{
  "kind": "build_request",
  "title": "Replace Trade Logger modal with inline Trade Logger on Trade Journal page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Trade Logger modal behavior and render the Trade Logger (trade creation/edit) UI inline within the Trades (Trade Journal) page instead of inside a popup dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "1: yes the trade logger modal is removed and built directly into the trades (trade Journal) page"
        ]
      },
      "acceptanceCriteria": [
        "Triggering the Trade Logger does not open any modal/dialog overlay.",
        "The Trade Logger UI is rendered as part of the Trades page layout (inline in-page).",
        "No backdrop/overlay blocks the rest of the app when the Trade Logger is open."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the Trade Logger open/close flow on the Trades page to behave like an inline 'Create Model' style experience: clicking \"Log Trade\" (and the Live Setup Identifier's \"Log Trade\" action) should reveal the inline Trade Logger section within the Trades page (not a new tab and not a modal), and closing should return the user to the normal Trade Journal list view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "2: It should behave similar to how models are created when selecting create model button. So doesnt have a tab, once you press log trade or live setup identifier's log trade it will open not as a modal but built into the trades tab"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Trades page \"Log Trade\" button shows the inline Trade Logger section within the Trade Journal page.",
        "Using the Live Setup Identifier 'log trade' flow opens the same inline Trade Logger section with the model and qualifying conditions preloaded (existing preloadedModelId/preloadedObservations behavior preserved).",
        "The inline Trade Logger provides a clear way to close/cancel and return to the Trade Journal list without leaving the Trades page route."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep the Trade Logger UI layout and fields practically the same as the current modal version while converting it to inline rendering (i.e., reuse the same form sections, inputs, and interactions).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "3: Yes the UI should stay practically the same as it is for the modal."
        ]
      },
      "acceptanceCriteria": [
        "All existing Trade Logger fields/sections present in the modal version remain available in the inline version.",
        "Trade create and trade edit flows still work (create submits via existing mutation; edit loads persisted values and updates via existing mutation).",
        "The inline Trade Logger remains responsive and does not introduce horizontal overflow/left-right scrolling (especially when the dynamic model-adherence section appears)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update any Trade Logger-specific layout/styling that was tied to a Radix Dialog (e.g., dialog content sizing/overflow rules) so the inline Trade Logger remains full-width, vertically stacked, and overflow-safe when rendered inside the Trades page container.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "removed and built directly into the trades (trade Journal) page"
        ]
      },
      "acceptanceCriteria": [
        "Inline Trade Logger fits within the Trades page container across breakpoints without creating a horizontal scrollbar.",
        "When the model adherence/model conditions section loads dynamically, subsequent sections reflow vertically (push content down) instead of forcing horizontal overflow.",
        "Any CSS classes/selectors that depended on dialog DOM structure are replaced or adapted so the inline layout is stable."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui (compose instead).",
    "Backend remains single-actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add a new tab inside Trade Journal (no Journal | Stats | Logger tab).",
    "Do not change the Trade Logger fields/validation logic beyond what is required to render inline.",
    "Do not redesign the Trade Journal trade list, analytics, or model builder flows beyond necessary adjustments for inline rendering."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}