{
  "kind": "build_request",
  "title": "Add Calendar view, dashboard customization, comparison tools, and advanced notes (screenshots-only)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an Advanced Notes enhancement for trades by extending the existing trade reflection data to support: (a) quick tags (multi-value text tags), and (b) categorized mistake/strength labels (multi-value, two distinct categories), while keeping existing fields (notes text, mood, images) intact.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Advanced Notes System\nUsers can attach screenshots, quick tags, voice notes, and categorized mistake/strength labels to each trade."
        ]
      },
      "acceptanceCriteria": [
        "A trade can persist and retrieve: notes (text), mood, images, quickTags[], mistakeTags[], strengthTags[] per user.",
        "Existing trades created before this change continue to load without errors and default missing new fields to empty arrays.",
        "The trade create/edit flow and trade outcome edit flow allow viewing/editing quick tags, mistake tags, and strength tags.",
        "All trade data remains isolated per user (no cross-user access)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current screenshot handling that stores images as data URLs in the frontend with true blob storage in the backend canister, using stable references (IDs/URLs) stored on the Trade.images field; restrict the scope to screenshots only (no voice notes).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "1: can you use blob storage? dont do voice, just screenshots for now"
        ]
      },
      "acceptanceCriteria": [
        "Uploading a screenshot results in the binary being stored via backend blob storage and the Trade.images array containing only stable references (not base64/data URLs).",
        "Trade detail/outcome editors display uploaded screenshots correctly after a page reload (proves persistence).",
        "Users can remove an uploaded screenshot from a trade, and it no longer appears on subsequent loads.",
        "No UI for voice notes exists; no backend fields/APIs for voice notes are required."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a Calendar month-grid view that aggregates trades per day and shows, for each day: total P/L, an adherence score summary, model used summary, tags summary, and notes indicator; days must be clickable to open the full list of trades for that date and allow navigation to trade details.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "A month-grid calendar that shows per-day: P/L, adherence score, model used, tags, and notes.\nDays should be clickable to open all trades for that date.\nMust integrate with advanced notes and screenshots."
        ]
      },
      "acceptanceCriteria": [
        "A new Calendar page/view is accessible from the main navigation.",
        "The calendar renders a standard month grid with correct weekday alignment and supports switching months.",
        "Each day cell displays: aggregated P/L for that day, adherence score summary (e.g., average or clearly labeled summary), model-used summary (e.g., most used or count by model), and indicators for presence of tags/notes/screenshots.",
        "Clicking a day opens a list of trades for that date (modal, drawer, or dedicated page) with at least: time, model, P/L, adherence score, and preview indicators for notes/tags/screenshots.",
        "From the day trade list, a user can open an existing trade detail view (reusing the existing TradeDetailDialog/flow).",
        "Calendar data is derived only from the authenticated user’s trades."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a Side-by-Side Comparison feature that allows users to compare two datasets: (a) two models, (b) two sessions, (c) two setups (as represented by models), (d) two adherence levels, or (e) two date ranges; provide predefined date range options (week, month) plus a custom start/end input; results must reuse the existing analytics computation utilities and display mirrored KPIs/charts/stat blocks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Side-by-Side Comparison Tools\nCompare any two datasets the app supports: two models, two sessions, two setups, two adherence levels, or two date ranges.\nDisplay mirrored KPIs, charts, and stat blocks for easy visual comparison.\n... supports predefined ranges (week, month, custom input)"
        ]
      },
      "acceptanceCriteria": [
        "A new Comparison page/view is accessible from the app navigation.",
        "Users can configure the left and right comparison panels independently, choosing comparison type and parameters (model/session/adherence/date range).",
        "Date range comparison supports quick picks: week, month, and a custom start/end selector.",
        "The comparison view renders mirrored KPI cards and at least one mirrored chart per side using existing analytics utility functions (e.g., metrics, equity curve, session metrics, adherence comparison, etc.).",
        "Changing comparison settings updates results without full page reload and remains responsive on mobile."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement a Customizable Analytics Dashboard that lets users choose which KPI/chart modules appear on the analytics home, supports reorder (drag-and-drop or equivalent), hide/show toggles, and persists the layout per user in the backend; the modules must be powered by the existing analytics calculations (adherence, bracket outcomes, model performance, P/L, scenario-related fields already present in trades).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Customizable Analytics Dashboard\nUsers choose which KPIs, charts, metrics, and data slices appear on their main analytics screen.\nMust support drag-and-drop ordering, hide/show toggles, and saving personal dashboard layouts per user.\nKPIs must pull from existing adherence scores, bracket outcomes, model performance, P/L, and scenario data."
        ]
      },
      "acceptanceCriteria": [
        "A user can open a ‘Customize dashboard’ control from the Analytics page and select dashboard modules to show/hide.",
        "Users can reorder modules; the chosen order persists across reloads.",
        "Dashboard layout preferences are saved per user in the backend and are not shared across users.",
        "If no saved layout exists for a user, the Analytics page falls back to a sensible default layout (current overview-style modules).",
        "Existing analytics filters (model/session/adherence threshold) continue to apply to the displayed modules."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Create a coherent, distinctive visual theme and apply it consistently across the new Calendar, Comparison, and Dashboard customization UI (colors, typography, spacing, card styles), ensuring a polished look and clear information hierarchy without using a blue/purple-dominant palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "New pages/components share consistent styling (headers, cards, table/list items, controls) and match the existing Tailwind/Shadcn design language.",
        "The theme avoids a blue/purple-dominant palette and remains readable in both light and dark modes (if theme switching exists).",
        "All new user-facing labels, empty states, and helper text are in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if required for stable state upgrades.",
    "Do not edit files under frontend/src/components/ui or any immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "No voice note feature: screenshots only for the Advanced Notes scope.",
    "All per-user data must remain isolated; do not introduce any cross-user read paths."
  ],
  "nonGoals": [
    "Implementing monetization/subscription tiers (Pro/Elite).",
    "Adding third-party authentication beyond Internet Identity.",
    "Real-time collaboration, chat, push notifications, email, or external database integrations.",
    "Full trade replay functionality beyond existing screenshots/notes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Validate trade models with customizable analytics, calendar-based review, and side-by-side comparisons."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Store trade screenshots via backend blob storage (no voice notes for now).",
      "Comparison date ranges should support predefined (week/month) plus custom start/end."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}