{
  "kind": "build_request",
  "title": "Fix custom-tool select Options input to allow commas and spaces",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Custom Tool Manager dialog’s Custom Property editor, update the “Options (comma-separated)” label and its adjacent input (the selected elements) so the input field allows users to type commas and spaces naturally (including multi-word options and typing trailing commas/spaces while editing) without the UI immediately stripping those characters.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "ive notices and issue with the 'comma-separated' where the input box doesnt allow me to use commas or spaces. Please update so i can actually utilize commas so multiple options are available as well as spaces as options may be multiple words."
        ]
      },
      "acceptanceCriteria": [
        "When typing into the selected Options input, commas and spaces remain visible as typed (e.g., the user can type: \"New York, Los Angeles, London\" without characters being removed mid-entry).",
        "Multi-word options containing spaces are preserved as single options (e.g., \"New York\" is treated as one option, not split).",
        "Options are parsed by commas into the underlying options array (trimming leading/trailing whitespace around each option) at a time that does not interfere with typing (e.g., on blur and/or on save), so validation for select properties still correctly enforces at least one option."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the selected label and input elements (the “Options (comma-separated)” label and its corresponding input in the Custom Tool Manager dialog property editor).",
    "Do not modify any files under frontend/src/components/ui (shadcn/ui components are read-only).",
    "Backend is single-actor Motoko; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not redesign the Custom Tool Manager dialog layout beyond the selected label/input behavior.",
    "Do not introduce new tool/property types or change how tools are stored in the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}