{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Inline Trade Logger on Trade Journal page (remove modal behavior)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove modal/dialog-based Trade Logger behavior and render the TradeForm inline within the Trades (Trade Journal) page layout.",
      "acceptanceCriteria": [
        "Triggering the Trade Logger does not open any modal/dialog overlay.",
        "The Trade Logger UI is rendered as part of the Trades page layout (inline in-page).",
        "No backdrop/overlay blocks the rest of the app when the Trade Logger is open."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Trades.tsx",
          "operation": "modify",
          "description": "Replace the current conditional modal-style rendering of TradeForm (and the fixed overlay ErrorBoundary fallback) with an inline section in the page flow. Ensure no fixed backdrop/overlay is rendered when showForm is true."
        },
        {
          "path": "frontend/src/components/TradeForm.tsx",
          "operation": "modify",
          "description": "Refactor TradeForm so it can render its existing UI without Radix Dialog (remove/disable Dialog/DialogContent usage for the Trades page inline experience), while preserving the same fields, sections, and interactions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the Trades page 'Log Trade' and Live Setup Identifier 'log trade' flows reveal the same inline Trade Logger section and allow closing back to the normal list view.",
      "acceptanceCriteria": [
        "Clicking the Trades page \"Log Trade\" button shows the inline Trade Logger section within the Trade Journal page.",
        "Using the Live Setup Identifier 'log trade' flow opens the same inline Trade Logger section with the model and qualifying conditions preloaded (existing preloadedModelId/preloadedObservations behavior preserved).",
        "The inline Trade Logger provides a clear way to close/cancel and return to the Trade Journal list without leaving the Trades page route."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Trades.tsx",
          "operation": "modify",
          "description": "Adjust the Trades page state flow so showForm toggles between list view and inline TradeForm view (create/edit). Keep existing preloadedModelId/preloadedObservations wiring from SetupIdentifier and ensure closing returns to the list view without route changes."
        },
        {
          "path": "frontend/src/components/TradeForm.tsx",
          "operation": "modify",
          "description": "Ensure TradeForm exposes a clear close/cancel control that calls onClose (used by the Trades page to return to the list view) and continues to honor preloadedModelId/preloadedObservations for the Setup Identifier flow."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Preserve the existing Trade Logger (TradeForm) UI layout/fields and keep trade create/edit flows working while converting to inline rendering.",
      "acceptanceCriteria": [
        "All existing Trade Logger fields/sections present in the modal version remain available in the inline version.",
        "Trade create and trade edit flows still work (create submits via existing mutation; edit loads persisted values and updates via existing mutation).",
        "The inline Trade Logger remains responsive and does not introduce horizontal overflow/left-right scrolling (especially when the dynamic model-adherence section appears)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TradeForm.tsx",
          "operation": "modify",
          "description": "Preserve all current form sections, calculations, validation, and create/update mutation logic; only restructure the outer container/wrapper to support inline rendering without altering the form’s field behavior."
        },
        {
          "path": "frontend/src/pages/Trades.tsx",
          "operation": "modify",
          "description": "When showForm is true, render the inline TradeForm within the Trades page container in a way that maintains responsiveness and avoids introducing new horizontal scroll in the page layout."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update Trade Logger styling previously tied to Radix Dialog so the inline Trade Logger is full-width, vertically stacked, and overflow-safe inside the Trades page container.",
      "acceptanceCriteria": [
        "Inline Trade Logger fits within the Trades page container across breakpoints without creating a horizontal scrollbar.",
        "When the model adherence/model conditions section loads dynamically, subsequent sections reflow vertically (push content down) instead of forcing horizontal overflow.",
        "Any CSS classes/selectors that depended on dialog DOM structure are replaced or adapted so the inline layout is stable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adapt the existing .trade-form-dialog rules into a dialog-agnostic wrapper style (e.g., shared class used by inline TradeForm) and remove reliance on Radix dialog-specific selectors/attributes so the same overflow-safety applies when rendered inline."
        },
        {
          "path": "frontend/src/components/TradeForm.tsx",
          "operation": "modify",
          "description": "Apply the updated wrapper class(es) for inline layout so sections stack vertically, respect container width, and remain overflow-safe when conditions/adherence sections render or re-render."
        }
      ]
    }
  ]
}