{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "ICT-focused trading journal whose main goal is validating trade models, with planned monetization via a hybrid subscription model (free tier + Pro/Elite).",
  "architectural_notes": [
    "Use blob storage for screenshot uploads/attachments (Advanced Notes).",
    "Defer voice notes; screenshots only for now.",
    "Comparison tool date ranges should support predefined ranges: week, month, custom input.",
    "Dashboard layout implementation choice left to developer discretion (grid vs reorderable list), but must support per-user saved layouts."
  ],
  "known_issues": [
    "Build/deploy attempt failed with error: \"AI couldn't process your request successfully. Try simplifying or rewording it.\""
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-implement-an-advanced-notes-enhancement-for-trades-by-extending-the-existing-trade-reflection-data-to-support-a-quick-tags-multi-value-text-tags-and-b-categorized-mistake-strength-labels-multi-value-two-distinct-categories-while-keeping-existing-fields-notes-text-mood-images-intact",
      "title": "Implement an Advanced Notes enhancement for trades by extending the existing trade reflection data to support: (a) quick tags (multi-value text tags), and (b) categorized mistake/strength labels (multi-value, two distinct categories), while keeping existing fields (notes text, mood, images) intact.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-current-screenshot-handling-that-stores-images-as-data-urls-in-the-frontend-with-true-blob-storage-in-the-backend-canister-using-stable-references-ids-urls-stored-on-the-trade-images-field-restrict-the-scope-to-screenshots-only-no-voice-notes",
      "title": "Replace the current screenshot handling that stores images as data URLs in the frontend with true blob storage in the backend canister, using stable references (IDs/URLs) stored on the Trade.images field; restrict the scope to screenshots only (no voice notes).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Customizable analytics dashboard with user-configurable KPIs/charts, drag/drop ordering, hide/show toggles, and per-user saved layouts integrated with adherence/model performance/P&L/scenarios",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Calendar month-grid view showing per-day P/L, adherence score, model used, tags, and notes; days clickable to open trades; integrates with notes/screenshots",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Side-by-side comparison tools to compare models/sessions/setups/adherence levels/date ranges with mirrored KPIs/charts using the same analytics engine; supports predefined ranges (week/month/custom)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Advanced notes system for each trade: screenshots (via blob storage) plus quick tags and categorized mistake/strength labels; notes visible in trade detail/calendar/comparison and feed analytics filters/breakdowns",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Monetization: hybrid subscription with free tier plus Pro/Elite paid tiers (freemium + tiered plans)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Add a Calendar month-grid view that aggregates trades per day and shows, for each day: total P/L, an adherence score summary, model used summary, tags summary, and notes indicator; days must be clickable to open the full list of trades for that date and allow navigation to trade details.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Add a Side-by-Side Comparison feature that allows users to compare two datasets: (a) two models, (b) two sessions, (c) two setups (as represented by models), (d) two adherence levels, or (e) two date ranges; provide predefined date range options (week, month) plus a custom start/end input; results must reuse the existing analytics computation utilities and display mirrored KPIs/charts/stat blocks.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Implement a Customizable Analytics Dashboard that lets users choose which KPI/chart modules appear on the analytics home, supports reorder (drag-and-drop or equivalent), hide/show toggles, and persists the layout per user in the backend; the modules must be powered by the existing analytics calculations (adherence, bracket outcomes, model performance, P/L, scenario-related fields already present in trades).",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Create a coherent, distinctive visual theme and apply it consistently across the new Calendar, Comparison, and Dashboard customization UI (colors, typography, spacing, card styles), ensuring a polished look and clear information hierarchy without using a blue/purple-dominant palette.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add Calendar view, dashboard customization, comparison tools, and advanced notes (screenshots-only)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}